// FileSyncAgent Localizable.strings

// The name of the product
"FileSyncAgent" = "Sincronização de Ficheiros";

// Text of "ok" button, used in various dialogs.
"OK" = "OK";

// Text of "cancel" button, used in various dialogs.
"CANCEL" = "Cancelar";

// Text of "Next" button, used in various dialogs
"NEXT" = "Seguinte";

// Text of "Done" button, used in various dialogs
"DONE" = "Terminado";

// Text of "Continue" button, used in various dialogs
"CONTINUE" = "Continuar";

// The name of iDisk disk image when renamed and moved to the desktop when iDisk syncing is disabled.
// The argument is the user's .Mac name.
// The optional second argument is a counter, for when a .dmg already exists. E.g. "Previous local iDisk for jholt 3.dmg"
"PREVIOUS DMG%"    = "iDisk local anterior para %@";
"PREVIOUS DMG DIR" = "iDisks locais anteriores";

// These strings are used after migrating a Tiger local iDisk image to Leopard (and later) iDisk syncing  [rdar://6607831]
"MIGRATION_COMPLETE" = "Existe uma cópia antiga do iDisk local neste computador que utiliza %@ de espaço em disco. Pretende mantê-la ou movê-la para o Lixo?";
"MIGRATION_DESKTOP"  = "Manter";
"MIGRATION_TRASH"    = "Mover para o Lixo";

// These strings are used to ask the user what to do with old and orphaned local iDisk images from all versions of iDisk syncing.  [rdar://6232713]
// Images can be found on the Desktop (moved there when iDisk syncing has been turned off in the past), as well as ~/Library/Mirrors (Tiger) and ~/Libary/FileSync (Leopard+)
// The code tracks where the images are found and presents three variants depending on where the images are (~/Desktop and/or ~/Library (i.e., INTERNAL)
"CLEANUP_IMAGES_DESK_1"         = "Existe uma cópia antiga do iDisk local neste computador que utiliza %@ de espaço em disco. Pretende mantê-la ou movê-la para o Lixo?";
"CLEANUP_IMAGES_INTERNAL_1"     = "Existe uma cópia antiga do iDisk local neste computador que utiliza %@ de espaço em disco. Pretende mantê-la ou movê-la para o Lixo?";
"CLEANUP_IMAGES_DESK_MULTI"     = "Existem várias cópias antigas do iDisk local neste computador que utilizam %@ de espaço em disco. Pretende mantê-las ou movê-las para o Lixo?";
"CLEANUP_IMAGES_INTERNAL_MULTI" = "Existem várias cópias antigas do iDisk local neste computador que utilizam %@ de espaço em disco. Pretende mantê-las ou movê-las para o Lixo?";
"CLEANUP_IMAGES_ALL"            = "Existem várias cópias antigas do iDisk local neste computador que utilizam %@ de espaço em disco. Pretende mantê-las ou movê-las para o Lixo?";

"CLEANUP_TITLE_1"     = "Foi encontrada outra cópia do seu iDisk no computador.";
"CLEANUP_TITLE_MULTI" = "Foram encontradas outras cópias do seu iDisk no computador.";

"Keep"  = "Manter";
"Trash" = "Mover para o Lixo";

// ----------------------------------
// "Your iDisk is almost full" dialog

"IDISK ALMOST FULL" = "O iDisk está quase cheio.";

// Text of the "warn again" checkbox.
"DO NOT WARN AGAIN" = "Não mostrar este aviso novamente.";

// Trash has files, too.
"ALMOST FULL TRASH MSG" = "Existem ficheiros no iDisk que estão no Lixo. Para libertar espaço, esvazie o Lixo.\n\nÉ possível aumentar o tamanho do iDisk no painel %@ das Preferências do Sistema.";

// No files in trash.
"ALMOST FULL .MAC MSG" = "É possível aumentar o tamanho do iDisk no painel %@ das Preferências do Sistema.";


// ----------------------------
// "Resizing your iDisk" dialog

"RESIZE IDISK"     = "É necessário ajustar o tamanho do iDisk no seu computador.";
"RESIZE IDISK MSG" = "O iDisk no seu computador estará temporariamente indisponível, durante a alteração do tamanho.";


// ----------------------------------
// "Can't turn off your iDisk" dialog

"CANT DISABLE"          = "Impossível desactivar o iDisk local.";
"CANT DISABLE BUSY MSG" = "O iDisk local não pode ser desactivado neste momento porque contém ficheiros que estão abertos. Feche os ficheiros e volte a tentar.";
"CANT DISABLE ERR MSG%" = "O iDisk local não pode ser desactivado neste momento porque ocorreu o erro %d. Volte a tentar mais tarde.";


// ---------------------------
// "log out / continue" dialog

"LOGOUT BUSY"     = "O iDisk está a ser sincronizado. Deseja continuar ou encerrar a sessão?";
"LOGOUT BUSY MSG" = "Pode encerrar a sessão após a sincronização do iDisk.";

// Text of the "log out" button.
"LOGOUT" = "Encerrar sessão";

// Text of the "continue" button.
"CONTINUE SYNC" = "Continuar a sincronização";


// Size formats, used in the conflict and exception dialog to show file sizes.
// The argument is the number of bytes, the suffixes are the abbreviations for the standard metric scales: kilobytes, megabytes, etc.
"%BYTES" = "%qu bytes";
"%KB"    = "%.2f KB";
"%MB"    = "%.2f MB";
"%GB"    = "%.2f GB";
"%TB"    = "%.2f TB";
"%PB"    = "%.2f PB";
"%XB"    = "%.2f XB";


// ----------------------------------
// Finder status messages

"Cleaning up..."                 = "A limpar…";
"Last sync cancelled."           = "Última sincronização cancelada.";
"Finder Settings"                = "Definições do Finder";				// [rdar://4735199]

// "DM_ACCOUNT_EXPIRED" was "Your %@ account has expired." prior to 10.5.3
"DM_ACCOUNT_EXPIRED"             = "A sua conta %@ expirou.";
"CREATE FAILED:NIL DMA"          = "Impossível activar a sincronização com o iDisk. Verifique o seu nome de utilizador e palavra-passe %@ no painel Preferências do Sistema %@.";
"CREATE FAILED:NO USERNAME"      = "Impossível activar a sincronização com o iDisk. Verifique o seu nome de utilizador e palavra-passe %@ no painel Preferências do Sistema %@.";
"CREATE FAILED:TOO BIG"          = "Impossível activar a sincronização do iDisk. O iDisk é maior do que o espaço livre disponível.";
"CREATE FAILED:UNKNOWN"          = "Impossível activar a sincronização do iDisk. Volte a tentar mais tarde.";
"Cannot sync more than one computer at a time."	= "Esta conta está a ser sincronizada com outro computador. Tente de novo mais tarde.";
"iDisk syncing unavailable."					= "A sincronização do iDisk não está disponível. Tente de novo mais tarde.";

// Was not localized prior to 10.5.3 (oops!)
"NO_ACTIVE_IDISK"                = "A sua conta %@ não tem um iDisk activo.";
